{
    "RoomReservationAgent": [
        "I want to book a room",
        "Can you help me reserve a study room?",
        "I have 4 people. Can you book me a place study?",
        "I want to reserve a room for 4 people",
        "Is room 203 available tomorrow morning from 8 to 10?",
        "Is room 111 for booking from 3 to 4pm this Friday",
        "I want to cancel the room reservation",
        "May I drop my room reservation?",
        "Can you check if room 210 is available the day after tomorrow?",
        "I want to book room with code name of 130.",
        "How can I book the study room?",
        "Can you get me a study room?",
        "Can you get me a study room next Monday?",
        "On this Friday, I need a study room for 13 people."
    ],
    "AcademicSupportAgent": [
        "I am researching on Economics. Can you suggest me some material to support my study?",
        "Can you recommend me some books on Computer Science",
        "Do you know any articles about Modern Art?",
        "I want to read more articles/books about Biology. Can you recommend me some?",
        "Who is responsible for Civic and Regional Development",
        "Which librarian I can contact regarding Communication Studies?",
        "I have questions about Finance. Does King Library have any expert in this area that I can talk to?",
        "I need some guides on Anthropology, who should I talk to?",
        "I am a Social Work student. I need helps on my homeworks. Can you tell me the person I can talk to?"
    ],
    "BuildingInformationAgent": [
        "What time does King open tomorrow?",
        "Does King Library close on weekend?",
        "Can I go to King LIbrary this Friday?",
        "Which days King open next week?",
        "What is the opening hour of King Library?",
        "Do you open this Tuesday?",
        "Do you close on this holiday?"
    ],
    "GoogleSearchAgent": [
        "How can I contact King Library?",
        "What software can I download from King Library?",
        "What hardware or tech equipment can I borrow from King?",
        "What kinds of services are offered at King?",
        "Who is the King Library Dean?",
        "Give me the list of King Library staff.",
        "Can the student work at the Library?",
        "What is the borrowing policies?",
        "How can I place library material on reserve?",
        "What can I place on Course Reserves",
        "Tell me about King Library services of picking up materials curbside",
        "Does King Library do delivery to my dorm, department, or home address?",
        "What is the return policies at King Library?",
        "Tell me about Limited Online Library Access Lending Services (LOLA)",
        "Can I borrow King material online?",
        "Does King have computer that open to use for Miami University student?",
        "What software is provided at King computers?",
        "Can I borrow laptop from King?",
        "Do you have Makerspace at King?",
        "How can I do 3d printing?",
        "What is the cost of 3d Printing",
        "How can I contact Makerspace?",
        "How can I reach the reading room for Faculty and Graduate student?",
        "I am a faculty, Do you have any room that I can use to read or research?",
        "Are you offering consultant for my writing piece?",
        "Tell me about Home writing center.",
        "Does King Library have anywhere to eat or drink?",
        "Does King offer printing?",
        "How can I print at King?",
        "Does King have any printers?",
        "Tell me about the Video Production and Audio Lab (AV Lab), Studio 303.",
        "What podcast equipment do you have?",
        "What filming equipment fo you have?",
        "Tell me about Data Services at King?",
        "Tell me about Data Services: National Institute of Health (NIH) Data Plan Requirements",
        "Does King provide Geographic Information System (GIS)",
        "What Data Analysis and Visualization Software can I have from King Library?",
        "Can you guide me on how to look for data?",
        "Does King offer any Data Courses, Guides, and Tutorials?",
        "Tell me about ICPSR?",
        "Tell me about Inter-university Consortium for Political and Social Research.",
        "How can I support King Library?"
    ]
}